postgresql-similarity-search.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-11-09 四 22:27 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Similarity Search in PostgreSQL</title>
<meta name="author" content="ChanMo" />
<meta name="description" content="This article explains how to use the PostgreSQL similarity() function to find similar data in the same table." />
<meta name="keywords" content="PostgreSQL, similarity, similarity search" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='bulma.min.css'><link rel='stylesheet' href='app.css'>
</head>
<body>
<div id="preamble" class="status">
<nav class='navbar is-dark is-fixed-top'><div class='container' style='max-width:768px;padding:0 1.5rem;'><div class='navbar-brand'><a href='/' class='navbar-item'>CHANMO</a><a role='button' class='navbar-burger' aria-label='menu' aria-expanded='false' data-target='main-nav'><span aria-hidden='true'></span><span aria-hidden='true'></span><span aria-hidden='true'></span></a></div><div id='main-nav' class='navbar-menu'><div class='navbar-end'><a href='https://github.com/ChanMo' class='navbar-item' target='_blank'>Github</a><a href='./about.html' class='navbar-item'>About</a><div class='navbar-item'><input type='checkbox' class='is-hidden' id='toggle' /><label for='toggle'></label></div></div></div></div></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Similarity Search in PostgreSQL</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb89b19d">1. How to Enable Similarity Search in PostgreSQL</a></li>
</ul>
</div>
</nav>
<p>
PostgreSQL provides the similarity() function to calculate the similarity between two strings.
This function can be used to find similar data in the same table.
</p>

<p>
For example, let's say we have a table that stores information about web pages,
with a column called title that represents the web page's title.
We can use the following SQL query to find web pages with titles that are more than 0.9 similar:
</p>

<div class="org-src-container">
<pre class="src src-SQL">SELECT a.id, b.id, similarity(a.title, b.title) as similarity FROM page AS a
JOIN page as b ON similarity(a.title, b.title) &gt; 0.9
WHERE a.id &lt;&gt; b.id ORDER BY similarity desc;
</pre>
</div>

<p>
This query will return all rows from the two tables page,
where a.id and b.id represent two different web pages.
The <code>similarity(a.title, b.title)</code> function will return the similarity
between the two strings a.title and b.title.
</p>

<p>
The return value of the <code>similarity()</code> function is a floating-point number
between 0 and 1. A higher value indicates that the two strings are more similar.
</p>

<p>
In the above query, we use the JOIN statement to join the two tables page.
This is to ensure that the results set contains two different web pages for a.id and b.id.
</p>

<div id="outline-container-orgb89b19d" class="outline-2">
<h2 id="orgb89b19d"><span class="section-number-2">1.</span> How to Enable Similarity Search in PostgreSQL</h2>
<div class="outline-text-2" id="text-1">
<p>
To enable similarity search in PostgreSQL, you need to install the pg<sub>trgm</sub> extension.
This extension provides a number of functions for calculating the similarity between strings using trigram matching.
</p>

<p>
To install the pg<sub>trgm</sub> extension, run the following command:
</p>
<pre class="example">
CREATE EXTENSION pg_trgm;
</pre>

<p>
Once the pg<sub>trgm</sub> extension is installed, you can use the similarity() function to calculate the similarity between two strings.
</p>

<p>
In conclusion, the PostgreSQL similarity() function provides an efficient way to find similar data in the same table.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src='app.js'></script>
</div>
</body>
</html>